import pandas as pd

import numpy as np

# создание дата фрейма: 

calls_list = [
   ['Финляндия', 7.84], ['Дания' , 7.62], ['Швейцария' , 7.57], ['Исландия' , 7.55], ['Нидерланды' , 7.46], 
   ['Норвегия' , 7.39], ['Швеция' , 7.36], ['Люксембург' , 7.32], ['Новая Зеландия' , 7.28], ['Австрия' , 7.27]
]
happy = pd.DataFrame(calls_list, columns = ['country',  'happy_indx'])

print(happy)

print(happy['happy_indx'].mean()) # Вычислите среднестатистический индекс счастья по следующим данным:

## ЗАДАНИЕ С МИДИЯМИ

from scipy.stats import f_oneway
from scipy.stats import shapiro

petersburg = [0.0974, 0.1352, 0.0817, 0.1016, 0.0968, 0.1064, 0.105]
magadan = [0.1033, 0.0915, 0.0781, 0.0685, 0.0677, 0.0697, 0.0764,
           0.0689]
tvarminne = [0.0703, 0.1026, 0.0956, 0.0973, 0.1039, 0.1045]

mussel = pd.DataFrame({'magadan' : [0.1033, 0.0915, 0.0781, 0.0685, 0.0677, 0.0697, 0.0764, 0.0689]})

mussel_2 = pd.DataFrame({'petersburg' : [0.0974, 0.1352, 0.0817, 0.1016, 0.0968, 0.1064, 0.105]})


mussel_new = pd.concat([mussel, mussel_2], axis = 1, 
    ignore_index=True,
)

print(mussel_new)

# Проведение теста на нормальность

H0 = 'Данные распределены нормально'
Ha = 'Данные не распределены нормально (мы отвергаем H0)'
alpha = 0.05

_, p = shapiro(mussel_new)
print('p=%.3f' % p)

# Интерпретация 

if p > alpha:
	print(H0)
else:
	print(Ha)
 
print(mussel_new.corr())

# Какова разница в среднем размере мидии в зависимости от города-производителя

_, p = f_oneway(petersburg, magadan)

H0 = 'Нет значимой разницы между средним размером раковины мидий в двух городах'
Ha = 'Есть значимая разница между средним размером раковины мидий в двух городах'

if p>alpha:
  print(f"{p} > {alpha}. Мы не можем отвергнуть нулевую гипотезу. {H0}")
else:
  print(f"{p} <= {alpha}. Мы отвергаем нулевую гипотезу. {Ha}")